Revit 2024 API
SteelElementProperties Properties
The SteelElementProperties type exposes the following members.
Properties
Name | Description
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
UniqueID
 This method will return the fabrication id. This represents the link between the Revit and the Steel Core element.
See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace